/******************************************************************************

Яких прямокутників з цілими сторонами більше: з периметром 1 996 або з периметром 1998?

*******************************************************************************/

#include <iostream>
#include <math.h>
using namespace std;

int main()
{
    setlocale(0, "");
    int P1, P2;
    cout << "Введите первый периметр прямоугольника: ";
    cin >> P1;
    cout << "Введите второй периметр прямоугольника: ";
    cin >> P2;
    int p1 = P1 / 2;
    int p2 = P2 / 2;
    int a, b;
    if (p1 % 2 == 0) {
        a = p1 / 2;
    }
    else {
        a = p1 / 2;
        a = trunc(a);
    } 
    if (p2 % 2 == 0) {
        b = p2 / 2;
    }
    else {
        b = p2 / 2;
        b = trunc(b);
    }
    if (a == b) {
        cout << "Этих прямоугольников одинаковое количество";
    }
    if (a > b) {
        cout << "Больше прямоугольников с периметром 1";
    }
    if (a < b) {
        cout << "Больше прямоугольников с периметром 2";
    }
    return 0;
}
