/******************************************************************************

   За даними сторонам трикутника знайти його площу (трикутник із сторонами 12, 17 та 23 см).

*******************************************************************************/

#include <iostream>
#include <cmath>
using namespace std;

int main()
{   setlocale(0,"");
    float a,b,c,S,p;
    a=12;
    b=17;
    c=23;
    p=(a+b+c)/2;
    S=sqrt(p*(p-a)*(p-b)*(p-c));
    cout << "S = " << S << " (см^2)";
    return 0;
}
